#+OPTIONS: toc:t
** lisp求值
求值是 lisp 解释器的核心，理解了求值过程也就学会了 lisp 编程的一半。一个symbol可以同时指代变量和函数，就是说一个foo，即是变量，又是 函数，在lisp里面是合法的。

  #+begin_src elisp
    (defun foo (x) (* x x))
    (setq foo 5)
    (foo foo)
  #+end_src

  #+RESULTS:
  : 25

一个要求值的 lisp对象被称为表达式（form）。所有的表达式可以分为三种： 符号、列表和其它类型（废话）。

1. 自求值表达式。前面说过数字、字符串、向量都是自求值表达式。还有两个特殊的符号\\
   t 和 nil\\
   也可以看成是自求值表达式。最特别的是，()求值返回nil，因为()和 nil根本就是一回事情。

2. 符号的求值结果就是符号的值。如果它没有值，就会出现void-variable 的错误。

3. 列表表达式。而列表表达式又可以根据第一个元素分为函数调用 、宏调用和特殊表达式（special form）三种。列表的第一个表达式如果是一个 符号，解释器会查找这个表达式的*函数值*。如果函数值是另一个符号，则会继续  查找这个符号的函数值。这称为”symbol function indirection”。最后直到某  个符号的函数值是一个 lisp 函数（lambda 表达式）、byte-code 函数、原子函数（primitive function）、宏、特殊表达式或 autoload对象。如果不是这 些类型，比如某个符号的函数值是前面出现的某个符号导致无限循环，或者某个 符号函数值为空，都会导致一个错误invalid-function。

求值过程就是沿着symbol路径一路走下去直到终点。

' 用来停止求职， 可以认为是一个地址操作&并且终止求值。quote引用一个对象，那么就是各种类型的对象都可以，返回这个对象地址。所以下面'cons 返回的是cons这个函数的地址。
  估计是 elisp 为了优化，quote 产生的对象是返回的是一个类似与引用的东西。 任何 side-effect 的 set* 函数都可以修改这个一个值

#+begin_src elisp -r
  (setq a '(1 2 3))
  (setq b a)
  (setcdr b '(2 4)) ;; 这个会改变 a (ref:quote)
#+end_src
  求值有两种，或者说两个地址空间。

  1. function value

  2. symbol value （应该叫 variable value？）

elisp中，函数和变量并不是完全平等的，你不能再象scheme中那样了。即使你(setq func(lambda (...)))，也无法直接 把它做为一个function来做，因为setq就注定了func只能被当作一个变量 来处理，而lisp只会试图去找func对应的函数。

  (defun f (x) (* x x)) ；
  +(f 2)是正确的 (funcall f 2)也是正确的。可以说defun给f 定义 了两个值。f的函数值 为这个函数，f的symbal值为这个函数的指针。对于函数指针来说 只能用funcall.  所以 (f 2) 和 (funcall f 2) 都是正确的。+
  **NO! NO!! NO!!!**
  (funcall f 2)不正确! (经eshell验证,也可以在scratch buffer里面 C-j 执行）

  Symbol's value as variable is void: f

  (setq f #'f) 以后 (funcall f 2)成功。\\
  执行 (setq f 1) 这个时候 f的 symbal值被改掉了。 \\
  (f 2)还是成功,但是 (funcall f 2)失败了。 \\

对于form来说有3种执行。

1. 不求职，如 (setq foo 123) ;foo是不求值的。
2. 取function value, 如 (setq foo (lambda (x) (* 3 x))) ，直接调用(foo 5)不能执行是因为foo作为第一个元素，求的是function cell中的值。你不得不(funcall foo 123), (apply foo 1 2 3)。
   funcall和apply的关系：  (funcall f x y ...)等价于(apply f (list x y ...))
3. 取symbol value, 其他的就都是这种情况。

#+begin_src elisp
  (setq foo (lambda (x) (* 3 x))) ; (lambda (x) (* 3 x)) \\
  (setq bar '(foo 5))             ; (foo 5) \\
  (car bar)                       ; foo\\
  (funcall foo 5)                 ; 15\\
  (funcall (car bar) (car (cdr bar))) ; wrong! why?
#+end_src

  (car bar)是符号'foo，而不是变量foo

  类似的

  #+begin_src elisp
    (setq foo 5）
    (setq bar 'foo)
    (defun f (x) (* x x))
    f(5) ; 正确
    f(bar) ; 错误， 相当于 (* 'foo 'foo)
  #+end_src

  所以要 (funcall (symbol-value (car bar)) 3)

  比如象(funcall cons 1 2)这样就是错误的 而(funcall 'cons 1 2)就是正确的。（因为cons没有variable value？）

  #+begin_src elisp
    (defun tmp (x)
      (let* ((foo (lambda (x) (1+  x)))
	     (bar (lambda (x) (* 3 x)))
	     (y '((foo 3)
		  (bar 5)))
	     (z '(bar 5)))
	    (mapcar (lambda (var)
			    (funcall (symbol-value (car var)) (nth 1 var))) y)))

    (tmp 5)
  #+end_src

  #+RESULTS:
  | 4 | 15 |

List的存在是lisp得名的原因。list只有三个基本操作：cons，car，cdr。cons表示的是，将一个symbol添加到某个现有list的表头上去；car表示取的某个list的表头；cdr表示取的某个list除了表头之外的剩余部分。car和cdr是标准的lisp黑话，没用过lisp系语言的人肯定不会知道 这两个词什么意思。

从概念上来说，cons cell 其实非常简单的，就是两个有顺序的元素。第一个叫 CAR，第二个就 CDR。CAR 和 CDR 名字来自于 Lisp。它最初在IBM 704机 器上的实现。在这种机器有一种取址模式，使人可以访问一个存储地址中的”地 址（address）"部分和"减量（decrement）“部分。CAR指令用于取出地址部分 ，表示(Contents of Address part of Register)，CDR指令用于取出地址的减 量部分(Contents of the Decrement part of Register)。cons cell 也就是 construction of cells。car 函数用于取得cons cell 的 CAR 部分，cdr 取 得 cons cell 的 CDR 部分。cons cell 如此简单，但是它却能衍生出许多高级 的数据结构，比如链表，树，关联表等等。

按列表最后一个 cons cell 的 CDR部分的类型分，可以把列表分为三类。如果它是nil的话，这个列表也称为”真列表” (true list)。'(1 2 3)

如果既不是 nil 也不 是一个 cons cell，则这个列表称为”点列表”(dotted list)。'(1 2 . 3)

还有一种可能，它指向列表中之前的一个 cons cell，则称为环形列表(circular list)。
#+begin_src elisp
'(1 . #1=(2 3 . #1#))                     ; => (1 2 3 . #1)
#+end_src

如果把真列表最后一个 cons cell 的 nil 省略不写，也就是 (1 . nil) 简写成 (1)，把 ( obj1 . ( obj2 . list)) 简写成 (obj1 obj2 . list)，那么列表最后可以写成一个用括号括起的元素列表：

 #+begin_src elisp
 '(1 . (2 . (3 . nil)))                  ; => (1 2 3)
 #+end_src

  列表和cons是等价的? 因为car和cdr对他们的操作结果是一样的。??
  *NO!*

  第一 '("first" . 1) ，不是一个 list  \\
   什么是 list ?\\
  a. nil 是一个 list\\
  b. 如果 A  是一个 list , (cons B A) 是一个 list\\
  *注意*
  (equal (cons 1 1) '( 1 . 1)) 返回 t  \\
  list 和 cons cell 是不一样的东西。 \\
   是 list 的东西不一定是  cons cell , 例如 nil ,  \\
   #+begin_src elisp
   (consp nil) => nil\\
   （listp nil) => t\\
   #+end_src
   是 cons cell 的东西不一定是 list  \\
   但是 listp 这个函数比较特殊 \\
       This function returns `t' if OBJECT is a cons cell or\\
  `nil'. \\
        Otherwise, it returns `nil'. \\
   他不是真正判断一个类型是不是 list .

  scheme 语言也许在 list 和 cons cell 上有更加明确的定义
  #+begin_quote
  guile> (pair? (cons 1 1))
   #t
  guile> (list? (cons 1 1))
   #f
  guile> (equal? (cons 1 1) '( 1 . 1))
   #t
  guile> (list? '())
   #t
  guile> (pair? '())
   #f
  #+end_quote

字符的读入语法是在字符前加上一个问号，比如 ?A 代表字符 'A'。 \\

?A ;=> 65\\
?a ;=> 97\\

